#+TITLE: Petrol: embedding a type-safe SQL API in OCaml using GADTs
#+DATE: <2023-03-23 Thu>
* Petrol: embedding a type-safe SQL API in OCaml using GADTs :ocaml:types:sql:api:design:
:PROPERTIES:
:EXPORT_DATE: <2023-03-23 Thu>
:PUBDATE: <2019-11-18 Mon>
:END:
:LOGBOOK:
- Note taken on [2023-03-31 Fri 18:38] \\
  Completed section on GADT based encoding
CLOCK: [2023-03-31 Fri 17:10]--[2023-03-31 Fri 18:38] =>  1:28
- Note taken on [2023-03-29 Wed 19:43] \\
  - Completed section on a macro based approach
CLOCK: [2023-03-29 Wed 18:00]--[2023-03-29 Wed 19:42] =>  1:42
CLOCK: [2023-03-28 Tue 20:10]--[2023-03-28 Tue 20:31] =>  0:21
- Note taken on [2023-03-28 Tue 19:28] \\
  - Wrote intro
CLOCK: [2023-03-28 Tue 17:00]--[2023-03-28 Tue 19:00] =>  2:00
CLOCK: [2023-03-28 Tue 16:59]--[2023-03-28 Tue 17:49] =>  0:50
- Note taken on [2023-03-23 Thu 19:26] \\
  Conducting a survey of existing OCaml sql interfaces
:END:

Databases are cool! Writing and maintaining interfaces between an
OCaml application and a SQL database? Generally less awesome.

Broadly speaking, this is because:

#+begin_quote
a) many SQL interfaces don't support checking of SQL operations
   without running them,
#+end_quote

and

#+begin_quote
b) SQL operations themselves are usually tightly coupled to the logic
   and data of a larger program, making them hard to run and test in
   isolation.
#+end_quote

Putting this all together, we end up with statements that can easily
become out of date with the underlying tables as they change, and
problems that only show up at runtime when the erroneous queries are
actually sent to the database.

Recently, I've been building a [[https://github.com/gopiandcode/ocamlot][large SQL-based application]] in OCaml,
and have found myself brushing against this problem with the libraries
in the OCaml ecosystem, which mostly all fall into this pitfall,
typically trusting user-provided annotations and delegating
correctness checks to runtime (we will provide a more detailed
comparison [[id:06540f94-9786-4768-ab36-cf7c8da89afc][near the end]]).

After hitting SQL errors for the umpteenth time, this prompted me to
investigate alternative embeddings of SQL in OCaml, and eventually
culminated in a new *type-safe* embedded SQL API for OCaml: [[https://github.com/Gopiandcode/petrol][Petrol]][fn:2]

Notably, Petrol provides an ergonomic OCaml API that mirrors SQL's
syntax, using a mixture cool features of OCaml, including GADTs and
polymorphic variants, to statically enforce the well-typedness of
queries and thereby eliminate any encoding or decoding related errors
occurring at runtime time:

#+begin_src ocaml
Query.select Expr.[name;age] ~from:t
|> Request.make_many
|> Petrol.collect_list db
#+end_src

In the rest of this blog post, I'm going to present an overview of the
different approaches to SQL embeddings that I considered in my
journey, and how the various language features of OCaml helped to
eventually lead to Petrol.

** Related work: Other SQL embeddings in OCaml
:PROPERTIES:
:ID:       06540f94-9786-4768-ab36-cf7c8da89afc
:END:
:LOGBOOK:
CLOCK: [2023-03-23 Thu 18:27]--[2023-03-23 Thu 19:26] =>  0:59
:END:

Of course, the techniques presented here aren't anything new: the
embedding that I have presented in this blog post is a fairly standard
technique --- the approach of encoding typed DSLs using GADTs is
something that dates even as far back as their conception; other
languages with similar type-system features such as Haskell or Scala
already have had [[https://hackage.haskell.org/package/esqueleto][mature libraries]] providing such support for ages now.

Surprisingly, however, within the OCaml ecosystem, this typed
embedding for SQL is fairly uncommon in libraries[fn:1].

Let's take a second to look at what other approaches to embedding SQL
in OCaml are currently available in the ecosystem:

- [[https://github.com/dbuenzli/rel][rel]] -- Unreleased library by the eponymous [[https://erratique.ch/contact.en][Dbunzli]]; it provides a
  typed embeded DSL, somewhat in the same vein as what has been
  presented in this post.

  It also follows the direction of defining schemas and types within OCaml directly:

  #+begin_src ocaml
  let trackId' = Col.v "TrackId" Type.Int trackId
  let name' = Col.v "Name" Type.Text name
  let albumId' = Col.v "AlbumId" Type.(Option Int) albumId

  let table =
    Table.v "Track"
      Row.(unit row * trackId' * name')
  #+end_src

  Instead of designing the API to superficially look like SQL, rel
  instead diverges from SQL's syntax, and instead attempts to provide
  a dialect-agnostic way of describing the relational query you are
  trying to perform in an idiomatic way:

  #+begin_src ocaml
  let person_age ~name =
    let* p = Bag.table Person.table in
    Bag.where Text.(p #. Person.name' = name) @@
    Bag.yield (p #. Person.age')
  (* corresponds to
     SELECT p.age 
     FROM person 
     WHERE p.name = $1 *)
  #+end_src

  Finally, Rel also has some optional live database interaction
  mechanisms --- in particular, a function to attempt to automatically
  work out the schema for an existing database by using the reflection
  capabilities most SQL databases usually provide you.
  
  #+begin_src ocaml
  val schema_of_db :
    ?schema:Rel.Schema.name -> t ->
    (Rel.Schema.t * string list, error) Stdlib.result
  (** [schema_of_db db] derives a best-effort schema value for the live
  database [db]. Note that the tables and rows and internal structure is
  not functional. It is however sufficient for schema renderings and
  computing schema changes. *)
  #+end_src

  Currently Rel is still unreleased and in development, so not ready
  to be used in anger.

- [[https://github.com/darioteixeira/pgocaml][PG'OCaml]] - a type safe API around postgres databases. It provides a
  string-embedded ppx-macro for writing SQL queries. The library is
  interesting in that it requires COMPILE-time access to the database,
  but as a trade-off, gives you fully automated inference of query
  parameters.

  #+begin_src ocaml
  let get name =
      [%pgsql dbh "select salary from employees where name = $name"]
  #+end_src

  The main problem with this approach is that it's hard to write code
  that implements migrations in OCaml, as the code assumes the DB
  already has the correct schema.

  Finally, PG'OCaml explicitly states that compatibility with other
  SQL services is explicitly a non-goal:

  #+begin_quote
  It doesn't work with other databases, nor will it ever work with other databases.
  #+end_quote

- [[https://github.com/mfp/ocaml-sqlexpr][ocaml-sqlexpr]] - A string-embedded ppx macro that provides a SQL
  DSL. It doesn't integrate with Caqti and provides its own database
  interaction code. Inputs and output types of a query are not checked
  w.r.t a table schema, and rely on the user to keep them up to date.

  #+begin_src ocaml
  S.iter db (fun (n, p) -> Printf.printf "User %S, password %S\n" n p)
      [%sqlc "SELECT @s{login}, @s{password} FROM users"];
  #+end_src

- [[https://github.com/roddyyaga/ppx_rapper][ppx-rapper]] - Another string-embedded ppx macro. Notable in that it
  vendors the postgres parser to ensure faithful syntax checking, but
  runs into the same limitations of ocaml-sqlexpr.

  #+begin_src ocaml
  let users =
    [%rapper
      get_opt
        {sql|
        SELECT @int{id}, @string{username}, @bool{following}, @string?{bio}
        FROM users
        WHERE following = %bool{following} and username IN (%list{%int{ids}})
        |sql}]
  #+end_src

- [[https://github.com/j0sh/ocaml-gensqlite][ocaml-gensqlite]] - another string-embedded ppx-macro that requires
  user to explicitly annotate queries with types and automates the
  construction of an idiomatic wrapper around the query:
  #+begin_src ocaml
  let (_, insert) = [%gensqlite dbh "INSERT INTO users(name, password) VALUES(>@username, >@pass)"]
  let () = insert ~username:"beakybird" ~pass:"supersecret" ()
  #+end_src

- [[https://github.com/zshipko/ocaml-ezsqlite][ocaml-ezsqlite]] - ezsqlite implements wrapper over the Sqlite API,
  queries are submitted as strings, and result types must be
  explicitly supplied by the user.
  #+begin_src ocaml
  let stmt = Ezsqlite.prepare db "CREATE TABLE testing (id INTEGER PRIMARY KEY, a TEXT, b BLOB, c INT, d DOUBLE);" in
  Test.check t "Create Table Step" (fun () ->
      Ezsqlite.exec stmt) () in
  #+end_src

- [[https://github.com/foretspaisibles/lemonade-sqlite][lemonade-sqlite]] - provides a monadic stream based API over a Sqlite
  db. The library is less concerned about type-safety of queries and
  more about being able to express stream-like transformations of data
  in a SQL database ergonomically.

  #+begin_src ocaml
  let really_insert batch =
    let ( @ ) = Sqlite.S.append in
    really_insert_index batch
    @ really_insert_query batch
    @ really_insert_response batch
  in
  Sqlite.insert
    (Sqlite.S.(concat (map really_insert stream))) handle
  #+end_src

- [[https://github.com/mmottl/postgresql-ocaml][postgresql-ocaml]] - low-level wrapper around postgres' C-api. Queries
  are submitted as strings. No embedded DSL or type-based guidance for
  the user.

- [[https://github.com/arenadotio/pgx][pgx]] - another postgres API wrapper -- slightly higher level than
  postgresql-ocaml, but queries are submitted as strings -- no
  host-language support for ensuring and maintaining SQL queries.

- [[https://ygrek.org/p/sqlgg/][sqlgg]] - somewhat orthogonal tool. Generates driver code (for a
  variety of backends including OCaml), given a set of SQL schemas and
  queries. Could be used for migrations as well, but overall somewhat
  unwieldy, as the SQL queries have to be maintained separately.

